### Importamos librerias

In [142]:
import pandas as pd
import xlrd
import re

#### Importamos el excel

In [143]:
tiburones_df= pd.read_excel("C:/Users/user/Jupyter/IronHack/Work - Python/Week2/Mini Project/GSAF5.xls")

#### Ahora vamos a observar la forma que tiene nuestro DataSet

In [144]:
tiburones_df.head(3)

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Species,Source,pdf,href formula,href,Case Number,Case Number.1,original order,Unnamed: 21,Unnamed: 22
0,15 Mar 2024,2024.0,Unprovoked,AUSTRALIA,Queensland,Bargara Beach,Swimming,Brooklyn Sauer,F,13,...,Tiger shark,"Yahoo News, 3/15/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,04 Mar 2024,2024.0,Unprovoked,USA,Hawaii,"Old Man's, Waikiki",Surfing,Matthew White,M,NaN,...,Tiger shark 8',"Surfer, 3/6/2024F",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,02 Mar-2024,2024.0,Unprovoked,USA,Hawaii,"Rainbows, Oahu",Swimming,NaN,F,11,...,3' to 4' shark,"Hawaii News Now, 3/4/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [145]:
tiburones_df.shape

(6969, 23)

In [146]:
tiburones_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6969 entries, 0 to 6968
Data columns (total 23 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            6944 non-null   object
 1   Year            6942 non-null   float64
 2   Type            6926 non-null   object
 3   Country         6894 non-null   object
 4   State           6462 non-null   object
 5   Location        6379 non-null   object
 6   Activity        6358 non-null   object
 7   Name            6724 non-null   object
 8   Sex             6365 non-null   object
 9   Age             3950 non-null   object
 10  Injury          6909 non-null   object
 11  Unnamed: 11     6382 non-null   object
 12  Time            3418 non-null   object
 13  Species         3812 non-null   object
 14  Source          6925 non-null   object
 15  pdf             6799 non-null   object
 16  href formula    6819 non-null   object
 17  href            6796 non-null   object
 18  Case Number     6798 non-null   object
 19  Case Number.1   6797 non-null   object
 20  original order  6799 non-null   float64
 21  Unnamed: 21     1 non-null      object
 22  Unnamed: 22     2 non-null      object
dtypes: float64(2), object(21)
memory usage: 1.2+ MB

In [147]:
tiburones_df.columns

Index(['Date', 'Year', 'Type', 'Country', 'State', 'Location', 'Activity',
       'Name', 'Sex', 'Age', 'Injury', 'Unnamed: 11', 'Time', 'Species ',
       'Source', 'pdf', 'href formula', 'href', 'Case Number', 'Case Number.1',
       'original order', 'Unnamed: 21', 'Unnamed: 22'],
      dtype='object')

In [148]:
tiburones_df.nunique()

Date              6003
Year               259
Type                12
Country            225
State              902
Location          4514
Activity          1587
Name              5683
Sex                  8
Age                243
Injury            4079
Unnamed: 11         12
Time               410
Species           1675
Source            5302
pdf               6789
href formula      6785
href              6776
Case Number       6777
Case Number.1     6775
original order    6797
Unnamed: 21          1
Unnamed: 22          2
dtype: int64

# Comenzamos a limpiar datos de la tabla

### Primeros limpiamos columnas que no tienen datos necesarios

In [149]:
tiburones_df["href formula"].unique

<bound method Series.unique of 0                                                     NaN
1                                                     NaN
2                                                     NaN
3                                                     NaN
4                                                     NaN
                              ...
6964    http://sharkattackfile.net/spreadsheets/pdf_di...
6965    http://sharkattackfile.net/spreadsheets/pdf_di...
6966    http://sharkattackfile.net/spreadsheets/pdf_di...
6967    http://sharkattackfile.net/spreadsheets/pdf_di...
6968    http://sharkattackfile.net/spreadsheets/pdf_di...
Name: href formula, Length: 6969, dtype: object>

Como contiene datos que no nos interesan los datos de estas columnas por que son fotos la eliminanos con tiburones_df.drop('Name',axis=1,inplace=True)

In [150]:
tiburones_df.drop("href formula",axis=1,inplace=True)

In [151]:
tiburones_df["href"].unique

<bound method Series.unique of 0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
6964    NaN
6965    NaN
6966    NaN
6967    NaN
6968    NaN
Name: href, Length: 6969, dtype: object>

Como contiene datos que no nos interesan los datos de estas columnas por que son fotos la eliminanos con tiburones_df.drop('Name',axis=1,inplace=True)

In [152]:
tiburones_df.drop("href",axis=1,inplace=True)

In [153]:
tiburones_df["Unnamed: 11"].unique

<bound method Series.unique of 0       NaN
1         N
2         N
3         N
4         N
       ...
6964    NaN
6965    NaN
6966    NaN
6967    NaN
6968    NaN
Name: Unnamed: 11, Length: 6969, dtype: object>

In [154]:
tiburones_df.drop("Unnamed: 11",axis=1,inplace=True)

In [155]:
tiburones_df.drop("Unnamed: 21",axis=1,inplace=True)

In [156]:
tiburones_df.drop("Unnamed: 22",axis=1,inplace=True)

In [157]:
tiburones_df["Case Number.1"].unique

<bound method Series.unique of 0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
6964    NaN
6965    NaN
6966    NaN
6967    NaN
6968    NaN
Name: Case Number.1, Length: 6969, dtype: object>

In [158]:
tiburones_df.drop("Case Number.1",axis=1,inplace=True)

In [159]:
tiburones_df["Case Number"].unique

<bound method Series.unique of 0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
6964    NaN
6965    NaN
6966    NaN
6967    NaN
6968    NaN
Name: Case Number, Length: 6969, dtype: object>

In [160]:
tiburones_df.drop("Case Number",axis=1,inplace=True)

In [161]:
tiburones_df["original order"].unique

<bound method Series.unique of 0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
        ..
6964   NaN
6965   NaN
6966   NaN
6967   NaN
6968   NaN
Name: original order, Length: 6969, dtype: float64>

In [162]:
tiburones_df.drop("original order",axis=1,inplace=True)

In [163]:
tiburones_df.drop("Year",axis=1,inplace=True)

In [164]:
tiburones_df.drop('Source',axis=1,inplace=True)

In [165]:
tiburones_df.drop('pdf',axis=1,inplace=True)

In [166]:
tiburones_df.head(3)

,Date,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Time,Species
0,15 Mar 2024,Unprovoked,AUSTRALIA,Queensland,Bargara Beach,Swimming,Brooklyn Sauer,F,13,"Minor injuries to back, abdomen and legs",16h00,Tiger shark
1,04 Mar 2024,Unprovoked,USA,Hawaii,"Old Man's, Waikiki",Surfing,Matthew White,M,NaN,"No injury, shark bit surfboard",NaN,Tiger shark 8'
2,02 Mar-2024,Unprovoked,USA,Hawaii,"Rainbows, Oahu",Swimming,NaN,F,11,Lacerations to left foot,13h30,3' to 4' shark

In [167]:
tiburones_df["Injury"].nunique()

4079

In [168]:
tiburones_df.columns

Index(['Date', 'Type', 'Country', 'State', 'Location', 'Activity', 'Name',
       'Sex', 'Age', 'Injury', 'Time', 'Species '],
      dtype='object')

### Limpiamos columnas para agrupar datos

In [169]:
tiburones_df[["Sex"]].value_counts()

Sex
M        5578
F         779
M           2
N           2
 M          1
.           1
M x 2       1
lli         1
Name: count, dtype: int64

#### Limpieza de columna 'Sex'

In [170]:
tiburones_df["Sex"] = tiburones_df["Sex"].astype(str)

In [171]:
mapping = {
    ' M' : 'Male',
    'M ' : 'Male', 
    'M x 2' : 'Male',
    'M' : 'Male',
    'F' : 'Female',
    'N' : 'nan',
    'lli' : 'nan',
    '.' : 'nan',
}

# Reemplazamos los datos de M x 2 y los diversos datos de M por "Male" y F por "Female"
tiburones_df["Sex"] = tiburones_df["Sex"].replace(mapping)

In [172]:
tiburones_df["Sex"].value_counts()

Sex
Male      5582
Female     779
nan        608
Name: count, dtype: int64

Ahora, que tenemos agrupados los datos en Male/Female, vamos a limpiar los datos que no tienen ninguna informaciÃ³n importante

In [173]:
tiburones_df = tiburones_df.drop(tiburones_df[tiburones_df['Sex'] == 'nan'].index)

In [174]:
tiburones_df[["Sex"]].value_counts()

Sex
Male      5582
Female     779
Name: count, dtype: int64

### Limpiar AÃ±os

In [175]:
tiburones_df['Year'] = tiburones_df["Date"].str[-4:]

In [176]:
tiburones_df.drop("Date",axis=1,inplace=True)

In [177]:
tiburones_df['Year'].value_counts()

Year
2015    141
2017    134
2016    128
2018    123
2011    122
       ...
1857      1
1859      1
955       1
rted      1
930s      1
Name: count, Length: 300, dtype: int64

### Limpiar Especies

Primero cambiamos el nombre de la columna

In [178]:
tiburones_df.rename(columns={'Species ': 'Species'}, inplace=True)
tiburones_df.columns

Index(['Type', 'Country', 'State', 'Location', 'Activity', 'Name', 'Sex',
       'Age', 'Injury', 'Time', 'Species', 'Year'],
      dtype='object')

### Limpiamos Especies

In [179]:
def replace_with_white_shark(value):
    if pd.notna(value):  # Check if value is not NaN
        if 'white' in value.lower():
            return 'White Shark'
    return value 

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_white_shark)

def replace_with_tiger_shark(value):
    if pd.notna(value):  # Check if value is not NaN
        if 'tiger' in value.lower():
            return 'Tiger Shark'
    return value 

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_tiger_shark)

def replace_with_bull_shark(value):
    if pd.notna(value):
        if 'bull' in value.lower():
            return 'Bull Shark'
    return value 

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_bull_shark)

def replace_with_grey_nurse_shark(value):
    if pd.notna(value):
        if 'nurse' in value.lower(): 
            return 'Nurse Shark'
    return value 

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_grey_nurse_shark)

def replace_with_blacktip_shark(value):
    if pd.notna(value): 
        if 'blacktip' in value.lower(): 
            return 'Blacktip Shark'
    return value 

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_blacktip_shark)

def replace_with_hammerhead_shark(value):
    if pd.notna(value):
        if 'hammerhead' in value.lower(): 
            return 'Hammerhead Shark'
    return value 

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_hammerhead_shark)

def replace_with_lemon_shark(value):
    if pd.notna(value):
        if 'lemon' in value.lower(): 
            return 'Lemon Shark'
    return value

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_lemon_shark)

def replace_with_blue_shark(value):
    if pd.notna(value):  # Check if value is not NaN
        if 'blue' in value.lower(): 
            return 'Blue Shark'
    return value

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_blue_shark)

def replace_with_brown_shark(value):
    if pd.notna(value):  # Check if value is not NaN
        if 'brown' in value.lower(): 
            return 'Brown Shark'
    return value

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_brown_shark)

def replace_with_raggedtooth_shark(value):
    if pd.notna(value):  # Check if value is not NaN
        if 'raggedtooth' in value.lower(): 
            return 'Raggedtooth Shark'
    return value

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_raggedtooth_shark)

def replace_with_bronze_shark(value):
    if pd.notna(value):  # Check if value is not NaN
        if 'bronze' in value.lower(): 
            return 'Bronze Shark'
    return value

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_bronze_shark)

def replace_with_caribbean_shark(value):
    if pd.notna(value):  # Check if value is not NaN
        if 'caribbean' in value.lower(): 
            return 'Caribbean Shark'
    return value

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_caribbean_shark)

def replace_with_mako_shark(value):
    if pd.notna(value):  # Check if value is not NaN
        if 'mako' in value.lower(): 
            return 'Mako Shark'
    return value

tiburones_df["Species"] = tiburones_df["Species"].apply(replace_with_mako_shark)

In [180]:
tiburones_df["Species"] = tiburones_df["Species"].str.replace(r".[0-9].", 'NA', regex=True)

In [181]:
mapping = {
    ' ' : 'NA',
    'no shark involvement' : 'NA',
    'no shark invovlement' : 'NA',
    'no shark invovlement - it ws a publicity stunt' : 'NA',
    'Invalid' : 'NA',
    'Invalid incident' : 'NA',
    'Questionable' :'NA',
    'Questionable incident' :'NA',
    '"small sharks"' : 'NA',
    '"a small shark"' : 'NA',
    'No shark involvement' : 'NA',
    '1NAm NA] shark' : 'NA',
    'Shark involvement prior to death was not confirmed' : 'NA',
    'Shark involvement not confirmed ' : 'NA',
    'NA shark ' : 'NA',
    '1NAm shark' : 'NA',
    "4' shark" : 'NA',
    "6' shark" : 'NA',
    "4' toNA shark" : 'NA',
    "2NAm NA] shark" : 'NA',
    "3' shark" : 'NA',
    "5' shark" : 'NA', 
    "3' toNA shark" : 'NA',
    "2 m shark" : 'NA',
    "3 m NA'] shark": 'NA',
    "3 m shark": 'NA', 
    "1NAm toNA5 m NA toNA] shark": 'NA',
    "3NAm NA'] shark": 'NA',
    "7' shark": 'NA', 
    "8' shark": 'NA',
    "5' toNA shark": 'NA',
    "2NAm shark": 'NA',
    "2' toNA shark": 'NA',
    "a small shark": 'NA',
    "Shark involvement prior to death not confirmed": 'NA',
    "1 m shark": 'NA',   
    "Shark involvement not confirmed": 'NA',
    "Shark involvement prior to death unconfirmed": 'NA',
    "NA shark": 'NA',
}

# Reemplazamos los datos de M x 2 y los diversos datos de M por "Male" y F por "Female"
tiburones_df["Species"]= tiburones_df["Species"].replace(mapping)

In [182]:
tiburones_df = tiburones_df.drop(tiburones_df[tiburones_df['Species'] == 'NA'].index)

In [183]:
tiburones_df["Species"].value_counts().head(12)

Species
White Shark          651
Tiger Shark          313
Bull Shark           209
Blacktip Shark       129
Nurse Shark          108
Bronze Shark          67
Blue Shark            54
Mako Shark            46
Hammerhead Shark      44
Lemon Shark           42
Raggedtooth Shark     42
Wobbegong shark       27
Name: count, dtype: int64

### Limpiar Estados

In [184]:
tiburones_df['State'] = tiburones_df['State'].astype(str)
tiburones_df['State'] = tiburones_df['State'].str.upper().str.replace(' ','_')
tiburones_df['State'] = tiburones_df['State'].str.replace('?','')
tiburones_df['State'] = tiburones_df['State'].str.replace(',','')
tiburones_df['State'] = tiburones_df['State'].str.replace(r"[0-9]", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"ÂºS,_ÂºE", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"KM_OFF_THE_COAST_OF_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"&_KM_FROM", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"_MILES_FROM", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"_MILES_FROM", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"OFF_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r",", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"MILES_FROM_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"MILES_EAST_OF_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"MILES_SE_OF_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"MILES_SOUTHWEST_OF_O'AHU_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"MILES_SOUTHEAST_OF_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"MILES_SOUTH_OF_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"MILES_NORTH_OF_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.replace(r"MILES_SOUTH_OF_", '', regex=True)
tiburones_df['State'] = tiburones_df['State'].str.lstrip('_')
tiburones_df['State'] = tiburones_df['State'].str.rstrip('_')

### Limpiar Activity

In [185]:
tiburones_df['Activity'] = tiburones_df['Activity'].astype(str)
tiburones_df['Activity'] = tiburones_df['Activity'].str.lower().str.replace(' ','_')
tiburones_df['Activity'] = tiburones_df['Activity'].str.lower().str.replace('_',' ')
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace('?','')
tiburones_df['Activity'] = tiburones_df['Activity'].str.lstrip('_')
tiburones_df['Activity'] = tiburones_df['Activity'].str.lstrip(' ')
tiburones_df['Activity'] = tiburones_df['Activity'].str.lstrip(' ')
tiburones_df['Activity'] = tiburones_df['Activity'].str.lstrip('.')
tiburones_df['Activity'] = tiburones_df['Activity'].str.lstrip('')
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*swimming.*", 'swimming', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*coming.*", 'swimming', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*escaping from alacatraz.*", 'swimming', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*cross.*", 'swimming', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*attempting.*", 'swimming', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*div.*", 'swimming', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*surf.*", 'surfing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*board.*", 'surfing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*snork.*", 'swimming', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*diving.*", 'diving', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*fishing.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*flounder.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*net.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*fihing.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*hunt.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*angling.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*catch.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*lob.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*cast.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*gath.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*spear.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*surfng.*", 'surfing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*surf-.*", 'surfing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*padd.*", 'surfing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*skiing.*", 'water sports', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*kayaking.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*paddleboarding.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*lifeguard.*", 'Lifeguard Activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*lifesaving.*", 'Lifeguard Activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*harp.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*collecting fish from net.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*collect.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*collecting fish in military trap when bit....*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*swimming.*", 'swimming', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*mming.*", 'swimming', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*hunting crayfish*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*collecting crayfish*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*setting crayfish pots*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*clams*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*oyst*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*riding*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*shark.*", 'direct interaction with a shark', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*aquar.*", 'direct interaction with a shark', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*ship.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*caps.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*over.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*row.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*yacht.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*boat.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*wreck.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*ka.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*crash.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*pa.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*ess.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*fell.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*collid.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*cruising.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*sea.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*can.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*raft.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*founder.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*sculling.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*air.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*pu.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*sitting.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*wading.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*stand.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*float.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*bath.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*walk.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*play.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*wash.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*dinghy.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*jum.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*water.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*resc.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*spl.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*wav.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*see.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*beach.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*walk.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*murder.*", 'Corpse', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*suicide.*", 'Corpse', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*victim.*", 'Corpse', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*shall.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*fil.*", 'Film/Photography', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*pho.*", 'Film/Photography', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*ski.*", 'water sports', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*racing.*", 'water sports', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*sail.*", 'water sports', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*kite.*", 'water sports', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*fish.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*shrimp.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*scooping.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*crabbing.*", 'fishing', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*we.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*nk.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*burn.*", 'Shipaccident (Shipwreck)', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*guard.*", 'Beach activity', regex=True)
tiburones_df['Activity'] = tiburones_df['Activity'].str.replace(r".*stiburones_df.*", 'Beach activity', regex=True)

In [186]:
tiburones_df = tiburones_df.drop(tiburones_df[tiburones_df['Activity'] == 'nan'].index)

In [187]:
tiburones_df['Activity'].value_counts()

Activity
swimming                           1742
surfing                            1400
fishing                             946
Beach activity                      609
Shipaccident (Shipwreck)            259
direct interaction with a shark      74
Corpse                                6
water sports                          4
Film/Photography                      3
sup                                   3
deserting the bark nazarene           1
nsb meshing                           1
reaching for life preserver           1
Beach activity a horse                1
hilo                                  1
loss of the schooner nomad            1
dry shelling                          1
batin                                 1
pÃªcheur de bichiques                  1
                                      1
stamding                              1
crawling                              1
picking opihi                         1
scalloping                            1
on a round-the-world expedition       1
hooking into a whale                  1
Name: count, dtype: int64

### Limpiar paises

In [188]:
tiburones_df["Country"]= tiburones_df["Country"].str.upper()

### Limpiando na en todo el dataset

In [189]:
tiburones_df.dropna(how='all', inplace=True)

### Limpiando Year

In [190]:
mapping = {
'-202' : 'no',
'-144' : 'no',
'3' : 'no',
'4' : 'no',
'11' : 'no',
'890' : 'no',
'903' : 'no',
'962' : 'no',
'963' : 'no',
'998' : 'no',
'999' : 'no',
'.C..' : 'no',
'006.' : 'no',
'007.' : 'no',
'009?' : 'no',
'018.' : 'no',
'021`' : 'no',
'07.a' : 'no',
'1.24' : 'no',
'1.30' : 'no',
'16.R' : 'no',
'4.00' : 'no',
'6.05' : 'no',
'700s' : 'no',
'75.b' : 'no',
'80s' : 'no',
'820s' : 'no',
'844)' : 'no',
'870s' : 'no',
'920s' : 'no',
'930s' : 'no',
'950s' : 'no',
'960s' : 'no',
'970s' : 'no',
'978`' : 'no',
'A.D.' : 'no',
'B.C.' : 'no',
'date' : 'no',
'Kong' : 'no',
'mith' : 'no',
'r' : 'no',
'rted' : 'no',
't937' : 'no',
'war"' : 'no',
'War)' : 'no',
'003' : 'no',
'999 ' : 'no',
'998 ' : 'no',
'963 ' : 'no',
'962 ' : 'no',
' (?) ' : 'no',
'011 ' : 'no',
'004 ' : 'no',
'80s ' : 'no',
'903 ' : 'no',
'r II' : 'no',

}
tiburones_df["Year"] = tiburones_df["Year"].replace(mapping)

In [191]:
tiburones_df = tiburones_df.drop(tiburones_df[tiburones_df['Year'] == 'no'].index)

### Filtrando aÃ±os del siglo 21

In [192]:
condition_year = tiburones_df['Year'] > "1999"
filtered_df = tiburones_df[condition_year]
filtered_df.head(3)

,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Time,Species,Year
0,Unprovoked,AUSTRALIA,QUEENSLAND,Bargara Beach,swimming,Brooklyn Sauer,Female,13,"Minor injuries to back, abdomen and legs",16h00,Tiger Shark,2024
1,Unprovoked,USA,HAWAII,"Old Man's, Waikiki",surfing,Matthew White,Male,NaN,"No injury, shark bit surfboard",NaN,Tiger Shark,2024
4,Unprovoked,INDIA,MAHARASHTRA,"Vaitarna River, Palghar District",fishing,Vicky Suresh Govari,Male,32,Calf of lower left leg injured,NaN,Bull Shark,2024

#### Filtrando Species

In [193]:
list_species = ['White Shark','Tiger Shark','Bull Shark','Blacktip Shark','Nurse Shark','Bronze Shark','Blue Shark','Mako Shark','Hammerhead Shark','Lemon Shark','Raggedtooth Shark','Wobbegong shark']
filtered_df2 = filtered_df.loc[filtered_df['Species'].isin(list_species)]
filtered_df2.head(3)

,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Time,Species,Year
0,Unprovoked,AUSTRALIA,QUEENSLAND,Bargara Beach,swimming,Brooklyn Sauer,Female,13,"Minor injuries to back, abdomen and legs",16h00,Tiger Shark,2024
1,Unprovoked,USA,HAWAII,"Old Man's, Waikiki",surfing,Matthew White,Male,NaN,"No injury, shark bit surfboard",NaN,Tiger Shark,2024
4,Unprovoked,INDIA,MAHARASHTRA,"Vaitarna River, Palghar District",fishing,Vicky Suresh Govari,Male,32,Calf of lower left leg injured,NaN,Bull Shark,2024

### Nos quedamos los que queremos estudiar

In [194]:
condition = ['USA', 'AUSTRALIA', 'SOUTH AFRICA', 'NEW ZEALAND']
top_tiburones = filtered_df2.loc[filtered_df2['Country'].isin(condition)]

#### Y ahora observamos los resultados para comenzar con el estudio

In [195]:
top_tiburones.head(3)

,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Time,Species,Year
0,Unprovoked,AUSTRALIA,QUEENSLAND,Bargara Beach,swimming,Brooklyn Sauer,Female,13,"Minor injuries to back, abdomen and legs",16h00,Tiger Shark,2024
1,Unprovoked,USA,HAWAII,"Old Man's, Waikiki",surfing,Matthew White,Male,NaN,"No injury, shark bit surfboard",NaN,Tiger Shark,2024
6,Unprovoked,AUSTRALIA,NEWSOUTHWALES,"Elizabeth Bay, Sydney Harbor",swimming,Lauren O'Neill,Female,29,Right leg bitten,20h00,Bull Shark,2024

In [196]:
top_tiburones.describe()

,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Time,Species,Year
count,686,686,686,677,686,685,686,548,686,555,686,686
unique,5,4,48,599,10,640,2,137,512,155,12,25
top,Unprovoked,USA,FLORIDA,"New Smyrna Beach, Volusia County",surfing,male,Male,15,FATAL,Afternoon,White Shark,2015
freq,559,367,119,21,294,37,582,13,62,27,259,49

#### Ranking Paises

In [197]:
top_tiburones[["Country"]].value_counts()

Country
USA             367
AUSTRALIA       217
SOUTH AFRICA     81
NEW ZEALAND      21
Name: count, dtype: int64

#### Ranking de Actividades

In [198]:
top_tiburones["Activity"].value_counts()

Activity
surfing                            294
swimming                           170
fishing                            142
Beach activity                      57
direct interaction with a shark     14
Shipaccident (Shipwreck)             4
sup                                  2
Film/Photography                     1
water sports                         1
picking opihi                        1
Name: count, dtype: int64

#### Ranking de Especies

In [199]:
top_tiburones[["Species"]].value_counts().head(12)

Species
White Shark          259
Tiger Shark          110
Bull Shark           103
Blacktip Shark        77
Bronze Shark          37
Nurse Shark           31
Raggedtooth Shark     16
Lemon Shark           13
Wobbegong shark       13
Mako Shark            12
Hammerhead Shark       9
Blue Shark             6
Name: count, dtype: int64

#### Pais y AÃ±o

In [221]:
# Gian
# Assuming 'top_tiburones' is your DataFrame containing the shark data
# Perform the groupby and count
grouped_data = top_tiburones.groupby(['Country', 'Year']).size().reset_index(name='Count')

# Export the grouped data to a CSV file
grouped_data.to_csv('shark_counts_by_country_year.csv', index=False)

#### Pais Especies

In [223]:
grouped_data = top_tiburones.groupby(['Country', 'Species']).size().reset_index(name='Count')
# Export the grouped data to a CSV file
grouped_data.to_csv('shark_counts_by_country_specie.csv', index=False)

#### Pais Actividad

In [203]:
country_activity_grouped_percentage = top_tiburones.groupby(['Country', 'Activity']).size().reset_index(name='Count')

# Calculate the total count of occurrences
total_count = country_activity_grouped_percentage['Count'].sum()

# Calculate the percentage for each group
country_activity_grouped_percentage['Percentage'] = (country_activity_grouped_percentage['Count'] / total_count) * 100

# If you want to sort the result by count in descending order:
country_activity_grouped_percentage = country_activity_grouped_percentage.sort_values(by='Count', ascending=False)
country_activity_grouped_percentage.head(20)

         Country                         Activity  Count  Percentage
22           USA                          surfing    150   21.865889
4      AUSTRALIA                          surfing    101   14.723032
23           USA                         swimming     83   12.099125
19           USA                          fishing     74   10.787172
5      AUSTRALIA                         swimming     59    8.600583
15           USA                   Beach activity     44    6.413994
3      AUSTRALIA                          fishing     42    6.122449
13  SOUTH AFRICA                          surfing     40    5.830904
14  SOUTH AFRICA                         swimming     22    3.206997
12  SOUTH AFRICA                          fishing     15    2.186589
7    NEW ZEALAND                          fishing     11    1.603499
18           USA  direct interaction with a shark     10    1.457726
0      AUSTRALIA                   Beach activity      9    1.311953
9    NEW ZEALAND                         swimming      6    0.874636
2      AUSTRALIA  direct interaction with a shark      4    0.583090
10  SOUTH AFRICA                   Beach activity      3    0.437318
8    NEW ZEALAND                          surfing      3    0.437318
1      AUSTRALIA         Shipaccident (Shipwreck)      2    0.291545
21           USA                              sup      2    0.291545
11  SOUTH AFRICA         Shipaccident (Shipwreck)      1    0.145773

#### Actividad Sexo

In [217]:
sex_activity_grouped_percentage = top_tiburones.groupby(['Activity', 'Sex']).size().reset_index(name='Count')

# Calculate the total count of occurrences
total_count = sex_activity_grouped_percentage['Count'].sum()

# Calculate the percentage for each group
sex_activity_grouped_percentage['Percentage'] = (sex_activity_grouped_percentage['Count'] / total_count) * 100

# If you want to sort the result by count in descending order:
sex_activity_grouped_percentage = sex_activity_grouped_percentage.sort_values(by='Count', ascending=False)
sex_activity_grouped_percentage.head(20)

                           Activity     Sex  Count  Percentage
12                          surfing    Male    265   38.629738
8                           fishing    Male    138   20.116618
14                         swimming    Male    126   18.367347
13                         swimming  Female     44    6.413994
1                    Beach activity    Male     36    5.247813
11                          surfing  Female     29    4.227405
0                    Beach activity  Female     21    3.061224
6   direct interaction with a shark    Male      9    1.311953
5   direct interaction with a shark  Female      5    0.728863
7                           fishing  Female      4    0.583090
4          Shipaccident (Shipwreck)    Male      3    0.437318
10                              sup    Male      2    0.291545
2                  Film/Photography    Male      1    0.145773
3          Shipaccident (Shipwreck)  Female      1    0.145773
9                     picking opihi    Male      1    0.145773
15                     water sports    Male      1    0.145773

#### Actividad Especies

In [216]:
species_activity_grouped_percentage = top_tiburones.groupby(['Species', 'Activity']).size().reset_index(name='Count')

# Calculate the total count of occurrences
total_count = species_activity_grouped_percentage['Count'].sum()

# Calculate the percentage for each group
species_activity_grouped_percentage['Percentage'] = (species_activity_grouped_percentage['Count'] / total_count) * 100

# If you want to sort the result by count in descending order:
species_activity_grouped_percentage = species_activity_grouped_percentage.sort_values(by='Count', ascending=False)
species_activity_grouped_percentage.head(20)

           Species        Activity  Count  Percentage
46     White Shark         surfing    143   20.845481
47     White Shark        swimming     57    8.309038
40     Tiger Shark         surfing     53    7.725948
3   Blacktip Shark         surfing     39    5.685131
44     White Shark         fishing     37    5.393586
15      Bull Shark        swimming     35    5.102041
41     Tiger Shark        swimming     32    4.664723
13      Bull Shark         fishing     25    3.644315
14      Bull Shark         surfing     22    3.206997
9     Bronze Shark         surfing     21    3.061224
43     White Shark  Beach activity     20    2.915452
11      Bull Shark  Beach activity     17    2.478134
4   Blacktip Shark        swimming     16    2.332362
38     Tiger Shark         fishing     14    2.040816
28     Nurse Shark         fishing     14    2.040816
8     Bronze Shark         fishing     13    1.895044
30     Nurse Shark        swimming     11    1.603499
2   Blacktip Shark         fishing      9    1.311953
0   Blacktip Shark  Beach activity      9    1.311953
23      Mako Shark         fishing      8    1.166181

In [224]:
# Assuming 'top_tiburones' is your DataFrame containing the shark data
# Perform the groupby and count
grouped_data = top_tiburones.groupby(['Sex']).size().reset_index(name='Count')

# Export the grouped data to a CSV file
grouped_data.to_csv('shark_by_sex.csv', index=False)

#### Link de descarga de la presentaciÃ³n

In [ ]:
link = https://docs.google.com/presentation/d/1mgK8UFL6DOF23dsxRDG9nukapL9opdgv77fazi9Nn78/edit#slide=id.g2cd9f340878_0_175